<template>
  <div v-if="isUpdate" class="zz-modal" @click.self="handleModal">
    <div class="zz-modalPanel zzBg-gray3">
      <div class="zz-headblack px-1">
        Update
      </div>
      <div class="zz-modalBody p-2">
        <div class="pb-4">
          <div class="zzCategoryHeaderBig">
            更新履歴
          </div>
          <!-- <ul class="list list-inside p-2 zz-text05"> -->
          <table class="p-2 zz-text05">
            <tbody>
              <tr>
                <td class="w-8">11/04</td>
                <td>
                  【データ/カタログ】
                  11/4新規パーツ追加（SSS、トップフォース、強化シャフト）
                </td>
              </tr>
              <tr>
                <td class="w-8">11/03</td>
                <td>【バグ/全体】 うはｗｗｗ5chに流れたｗｗｗｗｗ</td>
              </tr>
              <tr>
                <td class="w-8">10/31</td>
                <td>
                  【データ/カタログ】 10/25新規パーツ追加（小径タイプ2白）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/29</td>
                <td>
                  【データ/カタログ】 10/25新規パーツ追加（シャーシ色違い4種）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/29</td>
                <td>【データ/カタログ】 ボディ特性リスト作成</td>
              </tr>
              <tr>
                <td class="w-8">10/26</td>
                <td>
                  【機能実装/診断】 空転チェック用に最高速グリップ比をテスト実装
                </td>
              </tr>
              <tr>
                <td class="w-8">10/25</td>
                <td>
                  【データ/カタログ】
                  10/25新規パーツ追加（ディオスパーダ、FRP補強2段）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/25</td>
                <td>【機能実装/診断】 新ボディ特性「紅い閃光」実装</td>
              </tr>
              <tr>
                <td class="w-8">10/24</td>
                <td>【機能実装/診断】 10/21更新 スピードロス計算変更</td>
              </tr>
              <tr>
                <td class="w-8">10/24</td>
                <td>
                  【バグ/セッティング】
                  ノーマルアクセサリの排他が上手く動作していなかったのを修正
                </td>
              </tr>
              <tr>
                <td class="w-8">10/24</td>
                <td>【機能実装/診断】 10/21更新 最高速 加速度 計算式変更</td>
              </tr>
              <tr>
                <td class="w-8">10/24</td>
                <td>【機能実装/全体】 更新履歴を表示</td>
              </tr>
              <tr>
                <td class="w-8">10/24</td>
                <td>【見た目/全体】 ボタン配置調整</td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>
                  【機能実装/診断】 10/21更新
                  診断およびレース中にリヤタイヤの摩擦値が反映されるように
                </td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>
                  【機能実装/診断】 10/21更新
                  重心位置の計算にリヤホイールの重さが反映されるように
                </td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>【データ/カタログ】 10/21更新 改造7枠目 改造リスト</td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>【データ/カタログ】 10/21更新 改造項目リストの名称変更</td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>
                  【機能実装/改造】 10/21更新
                  新改造項目フロントステー(アルミ可変ダウンスラスト)
                </td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>【機能実装/診断】 10/21更新 重心</td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>
                  【機能実装/診断】 10/21更新
                  摩擦=(前摩擦*(ホイールベース/2+重心)+後摩擦*(ホイールベース/2-重心))/ホイールベース
                </td>
              </tr>
              <tr>
                <td class="w-8">10/23</td>
                <td>【機能実装/診断】 新ボディ特性「ワイルドラン」実装</td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【データ/カタログ】 10/21更新 ユニークボディ特性の名称変更(S)
                </td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【データ/カタログ】 10/21更新
                  新規パーツ追加（ストラトベクター、19mmアルミエアロ、クーリングシールド、アルミ可変）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>【機能実装/診断】 10/21更新 スラスト10度以上可能に</td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【データ/カタログ】 10/21更新
                  ボディスタミナ耐久値修正（ファイター+5、バックブレーダー+30、他+35）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【機能実装/診断】 10/21更新
                  大径スパイク・フロント・リヤのタイヤ摩擦値を56から76
                </td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【機能実装/診断】 10/21更新
                  節電UPと節電UP+の効果を約3割下方修正（節電UP1.6→1.4
                  節電UP+1.7→1.5）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【機能実装/診断】 10/21更新
                  バウンド抑制の桁数を1/1000（制振を1/10にした）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/21</td>
                <td>
                  【機能実装/診断】 10/21更新
                  制振の桁数を1/100（制振を1/10にした）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/14</td>
                <td>【見た目/診断】 ローラー減速参考値を別行に</td>
              </tr>
              <tr>
                <td class="w-8">10/07</td>
                <td>【機能実装/診断】 最高速到達時間 実装</td>
              </tr>
              <tr>
                <td class="w-8">10/07</td>
                <td>
                  【データ/カタログ】
                  10/7新規パーツ追加（小径ローハイトワンウェイ、コンカラーJr.、六角）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/01</td>
                <td>
                  【データ/カタログ】 9/25新規パーツ追加（大帝、スキッドゴム）
                </td>
              </tr>
              <tr>
                <td class="w-8">10/01</td>
                <td>
                  【データ/カタログ】
                  9/30新規パーツ追加（低摩擦色違い、アルミベア色違い）
                </td>
              </tr>
              <tr>
                <td class="w-8">09/23</td>
                <td>
                  【データ/カタログ】
                  9/23新規パーツ追加（タイプ5、ベアホーク、ローハイトWエアロ）
                </td>
              </tr>
              <tr>
                <td class="w-8">09/09</td>
                <td>
                  【データ/カタログ】
                  9/9新規パーツ追加（ビックバンゴースト、17アルミ、ジュラルミンステー）
                </td>
              </tr>
              <tr>
                <td class="w-8">09/04</td>
                <td>
                  【バグ/カタログ】
                  カタログのカテゴリが間違っていたものを修正（スペシャルボディ、FMレーサー）
                </td>
              </tr>
              <tr>
                <td class="w-8">09/02</td>
                <td>
                  【データ/カタログ】 9/2新規パーツ追加（カラーピックアップ赤）
                </td>
              </tr>
              <tr>
                <td class="w-8">08/26</td>
                <td>
                  【データ/カタログ】
                  8/26新規パーツ追加（新太陽、ショック吸収、FM強化）
                </td>
              </tr>
              <tr>
                <td class="w-8">08/25</td>
                <td>
                  【データ/カタログ】 8/25新規パーツ追加（バックブレーダー）
                </td>
              </tr>
              <tr>
                <td class="w-8">08/25</td>
                <td>【機能実装/診断】 新ボディ特性「パワーブースト」実装</td>
              </tr>
              <tr>
                <td class="w-8">08/19</td>
                <td>【データ/カタログ】 8/19新規パーツ追加（ReN SP）</td>
              </tr>
              <tr>
                <td class="w-8">08/14</td>
                <td>
                  【データ/プリセット】
                  モーター改造プリセットにパワー1パワー2を追加
                </td>
              </tr>
              <tr>
                <td class="w-8">08/14</td>
                <td>【見た目/プリセット】 削除ボタンを縦に</td>
              </tr>
              <tr>
                <td class="w-8">08/13</td>
                <td>
                  【データ/カタログ】
                  8/12新パーツ追加(7mm、ブーメランガンマ、ライトウェイト黄色)
                </td>
              </tr>
              <tr>
                <td class="w-8">08/05</td>
                <td>
                  【データ/カタログ】
                  8/5新規パーツ追加（カラーピックアップ黄色）
                </td>
              </tr>
              <tr>
                <td class="w-8">08/05</td>
                <td>【データ/カタログ】 ブレーキ名変更</td>
              </tr>
              <tr>
                <td class="w-8">07/29</td>
                <td>
                  【データ/カタログ】
                  7/29新パーツ対応（ウィング、タイプ4、イグレス）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/29</td>
                <td>【機能実装/評価】 耐風</td>
              </tr>
              <tr>
                <td class="w-8">07/28</td>
                <td>
                  【バグ/改造】
                  ジュラルミンの改造カテゴリを新カテゴリ「アルミフロントステー」に変更
                </td>
              </tr>
              <tr>
                <td class="w-8">07/26</td>
                <td>
                  【機能実装/診断】 ボディ特性対応（制振、パワードリフト）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/26</td>
                <td>
                  【データ/カタログ】
                  7/25新パーツ対応（ハリケーン、ショートスタビ、他）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/23</td>
                <td>
                  【見た目/レイアウト】
                  フローティングウィンドウの位置を下に下げる（同時に診断が見たい）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/23</td>
                <td>【機能実装/診断】 バウンド時間を仮実装</td>
              </tr>
              <tr>
                <td class="w-8">07/23</td>
                <td>【機能実装/診断】 小数点桁数を増やす</td>
              </tr>
              <tr>
                <td class="w-8">07/19</td>
                <td>
                  【バグ/評価】
                  値コピーで有効ローラー摩擦、抵抗が0だとスキップされちゃう
                </td>
              </tr>
              <tr>
                <td class="w-8">07/19</td>
                <td>
                  【バグ/評価】
                  値コピーして、スプレッドシートに貼ると、背景が灰色
                </td>
              </tr>
              <tr>
                <td class="w-8">07/18</td>
                <td>【バグ/改造】 ギヤシャの改造が間違ってるのを修正</td>
              </tr>
              <tr>
                <td class="w-8">07/15</td>
                <td>
                  【データ/カタログ】
                  7/15パーツ追加（黒メッキ10種、中空ホイールタイヤ、原始大帝、ジュラルミン）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/15</td>
                <td>【機能実装/診断】 新ボディ特性（節電UP+）対応</td>
              </tr>
              <tr>
                <td class="w-8">07/15</td>
                <td>
                  【バグ/カタログ】
                  カラーピックアップ紫のパーツが間違っていたのを修正
                </td>
              </tr>
              <tr>
                <td class="w-8">07/08</td>
                <td>
                  【データ/カタログ】 7/8パーツ追加（カラーピックアップ紫）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/03</td>
                <td>【機能実装/パーツ】 外すボタンを外に出す</td>
              </tr>
              <tr>
                <td class="w-8">07/03</td>
                <td>
                  【バグ/パーツ】 パーツ変更時肉抜きのチェックが外れるのを修正
                </td>
              </tr>
              <tr>
                <td class="w-8">07/03</td>
                <td>【機能実装/改造】 ギヤシャフトのプリセット対応</td>
              </tr>
              <tr>
                <td class="w-8">07/02</td>
                <td>
                  【機能実装/パーツ】
                  肉抜き新仕様対応（ファイターマグナムの肉抜きが0.2g）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/02</td>
                <td>
                  【データ/カタログ】 ノーマルアクセサリ、電池、カタログ対応
                </td>
              </tr>
              <tr>
                <td class="w-8">07/02</td>
                <td>
                  【機能実装/パーツ】
                  ノーマルギヤシャフト、ノーマルクラウンギヤ（仮）実装
                </td>
              </tr>
              <tr>
                <td class="w-8">07/02</td>
                <td>
                  【データ/カタログ】
                  7/1分更新データ対応（ファイターマグナム、次郎丸、ギヤシャフト、モタサポ）
                </td>
              </tr>
              <tr>
                <td class="w-8">07/01</td>
                <td>
                  【バグ/パーツ登録】
                  登録パーツを呼び出したやつを改造して新しく登録すると、呼び出し元も変更されてしまう
                </td>
              </tr>
              <tr>
                <td class="w-8">06/25</td>
                <td>
                  【データ/カタログ】
                  6/25新規パーツ追加（アバンテ銀メッキ、アバンテ金メッキ、プロトEVO、リアルEVOホイール前後）
                </td>
              </tr>
              <tr>
                <td class="w-8">06/24</td>
                <td>
                  【機能実装/評価】
                  スラストが0以下のとき、有効ローラー摩擦のローラーを空欄にする
                </td>
              </tr>
              <tr>
                <td class="w-8">06/24</td>
                <td>【データ/カタログ】 カラー抜け対応</td>
              </tr>
              <tr>
                <td class="w-8">06/20</td>
                <td>
                  【見た目/全体】 数字フォントが少し高い＆ちょっと詰まってる
                </td>
              </tr>
              <tr>
                <td class="w-8">06/17</td>
                <td>【データ/カタログ】 6/17新規パーツ追加</td>
              </tr>
              <tr>
                <td class="w-8">06/15</td>
                <td>
                  【バグ/パーツ】
                  パーツステータスのZ順が一番前に来てしまっている
                </td>
              </tr>
              <tr>
                <td class="w-8">06/15</td>
                <td>【見た目/支援】 見た目調整</td>
              </tr>
              <tr>
                <td class="w-8">06/14</td>
                <td>
                  【バグ/全体】
                  フローティングウィンドウの下部でフローティング外を選択してもフローティングが閉じない
                </td>
              </tr>
              <tr>
                <td class="w-8">06/14</td>
                <td>【機能実装/全体】 メイン画面のリセット</td>
              </tr>
              <tr>
                <td class="w-8">06/14</td>
                <td>【見た目/フッター】 ボタン見た目調整</td>
              </tr>
              <tr>
                <td class="w-8">06/10</td>
                <td>【データ/カタログ】 6/10パーツ更新</td>
              </tr>
              <tr>
                <td class="w-8">06/05</td>
                <td>
                  【バグ/改造】
                  改造の量はパーツの元ステータスに絶対値適用させてから
                </td>
              </tr>
              <tr>
                <td class="w-8">06/05</td>
                <td>
                  【バグ/評価】
                  有効ローラー摩擦、有効ローラー抵抗に改造が反映されてない
                </td>
              </tr>
              <tr>
                <td class="w-8">06/04</td>
                <td>【機能実装/全体】 公開範囲に応じて機能を分ける入り口</td>
              </tr>
              <tr>
                <td class="w-8">06/03</td>
                <td>【データ/パーツ】 6/3更新分</td>
              </tr>
              <tr>
                <td class="w-8">06/03</td>
                <td>【機能実装/診断】 スラスト角に下限設定</td>
              </tr>
              <tr>
                <td class="w-8">06/03</td>
                <td>
                  【バグ/診断】 最高速度計算のボディ特性の値が間違っていた
                </td>
              </tr>
              <tr>
                <td class="w-8">06/02</td>
                <td>【見た目/全体】 リストの最後を伸ばす</td>
              </tr>
              <tr>
                <td class="w-8">05/31</td>
                <td>【機能実装/セッティング】 「表示切替」ボタン</td>
              </tr>
              <tr>
                <td class="w-8">05/31</td>
                <td>
                  【機能実装/セッティング】 「すべてのパーツを外す」ボタン
                </td>
              </tr>
              <tr>
                <td class="w-8">05/31</td>
                <td>
                  【機能実装/タブ】 他のタブからセッティングをコピーする機能
                </td>
              </tr>
              <tr>
                <td class="w-8">05/31</td>
                <td>
                  【バグ/セッティング】
                  表示切り替え時に背面のグレーアウトのレイヤー修正
                </td>
              </tr>
              <tr>
                <td class="w-8">05/31</td>
                <td>
                  【バグ/セッティング】
                  表示切り替えのデフォ値をパーツ名に変更（アクティブ表示）
                </td>
              </tr>
              <tr>
                <td class="w-8">05/31</td>
                <td>【見た目/セッティング】 表示切り替えの見た目調整</td>
              </tr>
              <tr>
                <td class="w-8">05/30</td>
                <td>
                  【見た目/評価】 ABCアイコンの上にBGのチェックがかぶってる修正
                </td>
              </tr>
              <tr>
                <td class="w-8">05/29</td>
                <td>【見た目/全体】 CSS調整</td>
              </tr>
              <tr>
                <td class="w-8">05/29</td>
                <td>【見た目/改造】 精度ボタンが指カーソルにならない修正</td>
              </tr>
              <tr>
                <td class="w-8">05/29</td>
                <td>
                  【見た目/パーツ】
                  肉抜きのチェックボックスが改造箇所の数によってずれる
                </td>
              </tr>
              <tr>
                <td class="w-8">05/28</td>
                <td>【機能実装/出力】 診断にコピーボタン</td>
              </tr>
              <tr>
                <td class="w-8">05/28</td>
                <td>
                  【バグ/改造】 「済み」「残り」がすぐに反映されないのを修正
                </td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>
                  【機能実装/評価】 値のみコピー、ボディ特性をコピーに含める
                </td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>【データ/カタログ】 5/25パーツ追加</td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>
                  【機能実装/全体】 セッティング、登録パーツ、を残しつつリセット
                </td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>【バグ/パーツ】 「外す」ボタンが細くなるのを修正</td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>【機能実装/診断】 診断式つくる＆組み込む</td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>【機能実装/診断】 診断用UI</td>
              </tr>
              <tr>
                <td class="w-8">05/25</td>
                <td>【機能実装/全体】 公開範囲に応じて機能を分ける入り口</td>
              </tr>
              <tr>
                <td class="w-8">05/24</td>
                <td>
                  【バグ/改造】
                  スライドダンパー（ウィング）のグリスアップ改造の内容が間違っていたのを修正
                </td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>【バグ/評価】 値が更新されない修正</td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>【機能実装/出力】 総合の評価詳細の一番下にコピーボタン</td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>【機能実装/パーツ】 改造済みパーツを保存、呼び出し</td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>
                  【機能実装/評価】
                  タイヤ径スキルをフロントタイヤとリヤタイヤで分ける
                </td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>【機能実装/評価】 評価にデジタル追加、順番並び替え</td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>【見た目/全体】 CSS調整</td>
              </tr>
              <tr>
                <td class="w-8">05/22</td>
                <td>【バグ/出力】 テキストダンプが改造後更新されない修正</td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>
                  【機能実装/評価】
                  評価にローラー摩擦、ローラー抵抗、タイヤ摩擦を出す
                </td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>【機能実装/評価】 「デジタル」スキル追加</td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>
                  【バグ/改造】
                  スライドダンパーの改造項目から限界軽量を消しました
                </td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>【バグ/改造】 プリセットのスラスト角減少関連</td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>【データ/カタログ】 5/20追加データ対応</td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>【見た目/全体】 CSS調整</td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>
                  【見た目/全体】 「このサイトについて」ボタンを1行に収める
                </td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>【見た目/全体】 ボタン修正</td>
              </tr>
              <tr>
                <td class="w-8">05/20</td>
                <td>【データ/全体】 改造プリセット更新</td>
              </tr>
              <tr>
                <td class="w-8">05/19</td>
                <td>【見た目/全体】 css調整</td>
              </tr>
              <tr>
                <td class="w-8">05/18</td>
                <td>【機能実装/改造】 「まとめて改造」UI追加</td>
              </tr>
              <tr>
                <td class="w-8">05/18</td>
                <td>【データ/改造】 「まとめて改造」項目に無改造追加</td>
              </tr>
              <tr>
                <td class="w-8">05/17</td>
                <td>【挙動/パーツ】 選択時にウィンドウを閉じなくする</td>
              </tr>
              <tr>
                <td class="w-8">05/17</td>
                <td>【機能実装/改造】 レベル選択で1ボタンを用意</td>
              </tr>
              <tr>
                <td class="w-8">05/16</td>
                <td>
                  【バグ/セッティング】 タブ移動でパーツ詳細の表示が更新されない
                </td>
              </tr>
              <tr>
                <td class="w-8">05/16</td>
                <td>【見た目/全体】 border-roundを調整</td>
              </tr>
              <tr>
                <td class="w-8">05/14</td>
                <td>【見た目/全体】 横幅調整</td>
              </tr>
              <tr>
                <td class="w-8">05/13</td>
                <td>
                  【機能実装/改造】
                  評価パラメータ値をサーバ値に一致させる（スロット順による数値の変化をなくす）
                </td>
              </tr>
              <tr>
                <td class="w-8">05/13</td>
                <td>【機能実装/セッティング】 ノーマルパーツ対応</td>
              </tr>
              <tr>
                <td class="w-8">05/13</td>
                <td>【機能実装/改造】 「スラスト角の減少」改造追加</td>
              </tr>
              <tr>
                <td class="w-8">05/13</td>
                <td>【バグ/セッティング】 リセット直後にボディ選択できない</td>
              </tr>
              <tr>
                <td class="w-8">05/13</td>
                <td>
                  【バグ/改造】
                  「まとめて改造」の「改造をすべて取り消す」ボタンでパーツが外れる
                </td>
              </tr>
              <tr>
                <td class="w-8">05/11</td>
                <td>【機能実装/出力】 テキストコピーボタン</td>
              </tr>
              <tr>
                <td class="w-8">05/09</td>
                <td>【機能実装/セッティング】 タブ用アイコン作成</td>
              </tr>
              <tr>
                <td class="w-8">05/08</td>
                <td>【機能実装/テキスト】 テキスト出力機能（超短縮）</td>
              </tr>
              <tr>
                <td class="w-8">05/07</td>
                <td>【バグ/出力】 テキスト改造略称の表が間違ってた</td>
              </tr>
              <tr>
                <td class="w-8">05/06</td>
                <td>
                  【見た目/セッティング】
                  セッティング画面内のアイコン配置をしっかり並べる
                </td>
              </tr>
              <tr>
                <td class="w-8">05/06</td>
                <td>
                  【挙動/全体】
                  フローティングウィンドウの横幅を画面サイズ依存をやめる
                </td>
              </tr>
              <tr>
                <td class="w-8">05/06</td>
                <td>【見た目/セッティング】 グリッドの調整</td>
              </tr>
              <tr>
                <td class="w-8">05/05</td>
                <td>【見た目/全体】 フォントサイズ修正</td>
              </tr>
              <tr>
                <td class="w-8">05/05</td>
                <td>【見た目/改造】 マージン修正</td>
              </tr>
              <tr>
                <td class="w-8">05/05</td>
                <td>【見た目/改造】 レベル表記のフォントサイズ</td>
              </tr>
              <tr>
                <td class="w-8">05/05</td>
                <td>【見た目/パーツ】 改造スロットを少しだけ控えめに</td>
              </tr>
              <tr>
                <td class="w-8">05/05</td>
                <td>
                  【見た目/改造】 まとめて改造ウィンドウのフローティング順修正
                </td>
              </tr>
              <tr>
                <td class="w-8">05/04</td>
                <td>【挙動/改造】 改造プリセット更新</td>
              </tr>
              <tr>
                <td class="w-8">05/04</td>
                <td>【見た目/全体】 押せる部分はマウスカーソルを指に(PC)</td>
              </tr>
              <tr>
                <td class="w-8">05/04</td>
                <td>
                  【挙動/改造】 スロット選択の改造も職人技50をデフォルトにする
                </td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【プロモ/-】 収益検討。寄付ボタン検討</td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【機能実装/パーツ】 改造差分のプラマイ表示</td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【データ/改造】 改造プリセット更新</td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【データ/改造】 改造プリセット更新</td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【見た目/総合評価】 背景svg作成</td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【見た目/パーツ】 ステータスの表記を見やすくする</td>
              </tr>
              <tr>
                <td class="w-8">05/02</td>
                <td>【見た目/セッティング】 背景色調整</td>
              </tr>
              <tr>
                <td class="w-8">04/29</td>
                <td>【見た目/改造】 まとめて改造ボタンを大きく</td>
              </tr>
              <tr>
                <td class="w-8">04/29</td>
                <td>【挙動/改造】 バグ発生時の挙動</td>
              </tr>
              <tr>
                <td class="w-8">04/28</td>
                <td>【機能実装/タブ】 セッティング複数持てるように</td>
              </tr>
              <tr>
                <td class="w-8">04/28</td>
                <td>
                  【バグ/改造】 「選択スロット以下をまとめて改造」ボタン挙動
                </td>
              </tr>
              <tr>
                <td class="w-8">04/28</td>
                <td>【データ/カタログ】 4/15更新パーツ（コジマ）</td>
              </tr>
              <tr>
                <td class="w-8">04/27</td>
                <td>【見た目/セッティング】 セッティング画面に似せる</td>
              </tr>
              <tr>
                <td class="w-8">04/25</td>
                <td>【見た目/全体】 フォント変更</td>
              </tr>
              <tr>
                <td class="w-8">04/25</td>
                <td>
                  【挙動/改造】
                  まとめて改造、通常改造、デフォ値を職人技５０レベルに
                </td>
              </tr>
              <tr>
                <td class="w-8">04/25</td>
                <td>【見た目/総合評価】 ABCDE評価をアイコンsvg化</td>
              </tr>
              <tr>
                <td class="w-8">04/24</td>
                <td>【機能実装/評価】 計算式変更対応</td>
              </tr>
              <tr>
                <td class="w-8">04/24</td>
                <td>【機能実装/カタログ】 改造済みパーツのプリセット提供</td>
              </tr>
              <tr>
                <td class="w-8">04/24</td>
                <td>
                  【データ/カタログ】
                  4/22パーツ更新対応（ハイパーミニ、トルクチューン）
                </td>
              </tr>
              <tr>
                <td class="w-8">04/19</td>
                <td>【データ/改造】 リヤホイール改造カテゴリを分ける</td>
              </tr>
              <tr>
                <td class="w-8">04/19</td>
                <td>【見た目/カタログ】 色対応</td>
              </tr>
              <tr>
                <td class="w-8">04/18</td>
                <td>
                  【見た目/セッティング】
                  選択パートの黄色オーラをアプリに合わせて緑チェックにする
                </td>
              </tr>
              <tr>
                <td class="w-8">04/18</td>
                <td>
                  【挙動/改造】 選択スロット以下をまとめて改造ボタン挙動調整
                </td>
              </tr>
              <tr>
                <td class="w-8">04/18</td>
                <td>
                  【見た目/全体】
                  画面縦幅変わった瞬間、黒フィルムが足りて無いのが見える
                </td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>
                  【見た目/改造】
                  レベル精度一括ウィンドウ、パーツ選択ウィンドウ調整
                </td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【見た目/セッティング】 横幅が広いブラウザ対応</td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【見た目/改造】 ボタンと背景色調整</td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【見た目/改造】 ウィンドウ境界の色調整</td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【見た目/改造】 フォント、配置調整</td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【挙動/改造】 別パーツに変えたときの改造枠挙動</td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【バグ/評価】 評価詳細▼が開かない</td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>
                  【データ/カタログ】
                  4/15新パーツ対応（スピンコブラ、トレッドタイヤ前後、リアルホイール前後）
                </td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>
                  【見た目/パーツ】
                  ステータス、改造スロット、改造ウィンドウのフォント調整
                </td>
              </tr>
              <tr>
                <td class="w-8">04/17</td>
                <td>【見た目/改造】 レベル調整ボタンをアプリに似せる</td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>【見た目/セッティング】 パーツのカラーをシートに入れる</td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>【見た目/セッティング】 アイコンの色を2色に拡張</td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>【見た目/セッティング】 アイコン正方形にする</td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>【見た目/セッティング】 文字数長くても正方形を保つ</td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>【見た目/セッティング】 アイコンを見やすく修正</td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>
                  【見た目/セッティング】
                  画面を横向きにしたときに、アイコンが小さい＆パーツ名が長いとはみ出る
                </td>
              </tr>
              <tr>
                <td class="w-8">04/16</td>
                <td>【見た目/セッティング】 パーツにコース適正を表示</td>
              </tr>
              <tr>
                <td class="w-8">04/14</td>
                <td>【データ/カタログ】 「大径ノーマル(赤)・フロント」削除</td>
              </tr>
              <tr>
                <td class="w-8">04/12</td>
                <td>【挙動/改造】 以下の改造ボタン挙動調整</td>
              </tr>
              <tr>
                <td class="w-8">04/12</td>
                <td>【バグ/改造】 計算後の数値がずれてる</td>
              </tr>
              <tr>
                <td class="w-8">04/12</td>
                <td>
                  【見た目/パーツ】
                  コース適正が無いものは、空白ではなくて「―」とする
                </td>
              </tr>
              <tr>
                <td class="w-8">04/10</td>
                <td>
                  【見た目/パーツ】 肉抜きの箇所のわからない場合に「―」を表示
                </td>
              </tr>
              <tr>
                <td class="w-8">04/10</td>
                <td>【見た目/改造】 ボタン位置調整</td>
              </tr>
              <tr>
                <td class="w-8">04/10</td>
                <td>【見た目/改造】 レベルボタン調整</td>
              </tr>
              <tr>
                <td class="w-8">04/10</td>
                <td>
                  【バグ/改造】
                  一括改造チェック入れると、上限通り越して6枠改造される
                </td>
              </tr>
              <tr>
                <td class="w-8">04/10</td>
                <td>
                  【見た目/パーツ】 精度とレベルの入ってる白い枠をもう少し縦短く
                </td>
              </tr>
              <tr>
                <td class="w-8">04/10</td>
                <td>
                  【見た目/改造】 レベルのボタンと精度のボタンの横幅をそろえる
                </td>
              </tr>
              <tr>
                <td class="w-8">04/08</td>
                <td>【データ/カタログ】 4/8新パーツ対応</td>
              </tr>
              <tr>
                <td class="w-8">04/06</td>
                <td>【挙動/評価】 電池の重さ足す</td>
              </tr>
              <tr>
                <td class="w-8">04/06</td>
                <td>
                  【バグ/改造】 フロントタイヤとリヤホイールが改造できない
                </td>
              </tr>
              <tr>
                <td class="w-8">04/06</td>
                <td>
                  【挙動/改造】
                  一括改造の際、チェックをやめて以下を改造ボタンにする
                </td>
              </tr>
              <tr>
                <td class="w-8">04/06</td>
                <td>【見た目/改造】 パーツを「外す」ボタン調整</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【挙動/セッティング】
                  ノーマルアクセサリは表示せずに、同種のパーツ付けてなかったら自動でつける（計算に含める）
                </td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【挙動/セッティング】 ノーマルアクセは表示せずに裏で計算を行う
                </td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>【プロモ/-】 アプリ名</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>【プロモ/-】 OGP画像</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【プロモ/-】
                  権利表記（本家）、コピーライト（OSS）、問い合わせ先
                </td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>【プロモ/-】 オープンソース</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【プロモ/-】 貢献方法（バグ報告、情報提供、データメンテ）
                </td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>【バグ/パーツ】 パラメータが表示されない</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>【バグ/パーツ】 肉抜きのチェックのあとにボディ切り替え</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【バグ/改造】
                  最大改造チェック入れて改造すると、改造ウィンドウ閉じたときにスロットが空になる
                </td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>【挙動/改造】 空の改造枠を選択時の挙動</td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【機能実装/全体】 トップ階層で自分のLvを保持できるようにする
                </td>
              </tr>
              <tr>
                <td class="w-8">04/05</td>
                <td>
                  【見た目/セッティング】
                  ページリロード時、スクロール時の謎挙動修正
                </td>
              </tr>
              <tr>
                <td class="w-8">04/04</td>
                <td>
                  【挙動/評価】 評価詳細の項目を全項目出して、順番に並べる
                </td>
              </tr>
              <tr>
                <td class="w-8">04/04</td>
                <td>【バグ/改造】 （改造なし）にレベルがついてしまう</td>
              </tr>
              <tr>
                <td class="w-8">04/04</td>
                <td>【見た目/パーツ】 ボディ特性を青い枠でイイ感じに囲む</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【バグ/セッティング】 ペアカテゴリがうまく動かない。</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【データ/カタログ】 3/26新パーツ対応</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>
                  【挙動/セッティング】 同じアクセサリが2個選べないようにする
                </td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【機能実装/セッティング】 ローラー上下を追加</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【機能実装/評価】 ABC評価対応</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>
                  【バグ/セッティング】
                  小径ホイールに大径タイヤが装着できてしまう
                </td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>
                  【見た目/改造】
                  フローティングウィンドウが出てるときは背景に半透明黒をかぶせる
                </td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【挙動/改造】 改造ウィンドウ閉じる挙動変更</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【データ/カタログ】 「小径タイプ2(緑)・フロント」を追加</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>
                  【データ/カタログ】
                  4/1新パーツ対応（ボディ3追加、タイヤ2追加）
                </td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【見た目/パーツ】 パーツリスト並び替え（50音順）</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【見た目/改造】 改造ウィンドウ表示位置調整</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【見た目/全体】 横幅を固定</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>
                  【機能実装/改造】 レベルの上下をゲーム基準にする（[-10][-]
                  Lv.** [+][+10][最大] ）
                </td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【バグ/パーツ】 節電が0.001ずれる。四捨五入もんだい？</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【バグ/改造】 レベルどこまででも上がる。マイナスも入る</td>
              </tr>
              <tr>
                <td class="w-8">04/02</td>
                <td>【データ/カタログ】 パーツ選択のソートを50音順に</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/セッティング】 アイコン作成</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【機能実装/改造】
                  改造UIでイイ感じとかとレベルを調整しやすくする
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【バグ/セッティング】
                  リロードしたあと、パーツをタップすると装着表示が消える
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【バグ/改造】
                  ボディオプションの改造がない、アクセサリーの改造がない
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【機能実装/改造】 改造カテゴリ</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/パーツ】 フォント調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 スクロールバー表示</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【挙動/改造】 既に設定済みの情報を表示</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【挙動/評価】 改造でしか付かないパラメータ加算の未考慮</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【機能実装/改造】 肉抜き対応</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【機能実装/改造】 一括でレベルと精度を設定する機能実装</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【バグ/改造】 ホイールのスキル「ウェーブ」が表示されない
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【データ/カタログ】 ウイングをボディオプションに変更</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/パーツ】 改造項目表示調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/パーツ】 コース適正色対応</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 現在の状態を黄色に</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 詳細を消す</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 選択できないときの見た目調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 フォント調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 空きスロット見た目調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/評価】 フォント調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【見た目/セッティング】 現在選択しているパーツの見た目対応
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【機能実装/パーツ】 パーツ選択方法を変更</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【プロモ/-】 GoogleAnalytics設置</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【バグ/改造】 回数上限があるものでも選択できてしまう</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【バグ/改造】
                  無改造の状態でスロット選択後、レベルや精度を設定して「閉じる」を押すと無改造のレベル付きができる
                  別のスロット選択でも、さっきのスロットが無改造のレベル付きになる
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【バグ/改造】
                  あるパーツで改造したのち、他の未改造パーツを選択し同じIndexで左側に品質とレベルが残ってしまっている。空になるのが正しい。
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【データ/カタログ】 パーツ名称に(赤)(緑)(黄)を入れる</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/セッティング】 フロントステーアイコン修正</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/パーツ】 至高の逸品（左詰め） Lv.**（右詰め）</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/パーツ】 改造項目を詰める</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/パーツ】 ボディ特性はボディだけ</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 済みは1以上のみ表示</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 フォント調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【見た目/改造】 フォントサイズ調整</td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【見た目/セッティング】
                  ローラーアイコン2色刷り対応のためのアイコン更新
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【見た目/パーツ】 パーツ選択のプルダウンが画面に収まるように
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【見た目/パーツ】
                  改造ウィンドウとパーツ詳細ウィンドウを同じ見た目にする
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>
                  【見た目/改造】
                  改造項目と改造項目の隙間をパーツ詳細の改造スロットの隙間に合わせる
                </td>
              </tr>
              <tr>
                <td class="w-8">--/--</td>
                <td>【機能実装/評価】 コース適正表示</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { mapState } from 'vuex'

export default {
  computed: {
    ...mapState('ing', {
      isUpdate: (state) => state.isUpdate,
    }),
  },
  methods: {
    handleModal() {
      this.$store.commit('ing/setUpdate', false)
    },
  },
}
</script>

<style lang="less" scoped></style>
